# Summary of Analysis Conducted
## Background: 
I conducted analyis of purchase data provided by an independent gaming company on their most recent fantasy game "Heroes of Pymoli." General analysis requested was on:
* General Summary Statistics
* Player Gender Demographics
* Purchase Analysis by Gender
* Age Demographics
* Top Spenders by Screen Name
* Most Popular Items Purchased
* Items Generating the Most Revenue

## Findings:
* The dataset contained 576 unique players who made 780 purchases of one or more of 179 unique items offered to enhance the game experience.  The average price of an item was just over three dollars and generated over two thousand dollars
* The majority of players (84%) are male and make an average purchase of just over four dollars; while, female players made an average purchase of just short of four dollars and fifty cents.
* The largest age category is 20-24 (~45%) making an average purchase of four dollars and thirty-two cents. The age category with the highest average total purchase is 35-49 while making up just over five percent (5.38%)
* The top spender made five purchases for a total purchase value of eight-teen dollars and ninty-six cents.
* The most popular item purchased was the "Final Critic" (13 were purchased) for a total revenue of about sixty dollars, followed by Oathbreaker, Last Hope of the Breaking Storm (12 were purchased) for a total revenue of fifty dollars.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (create a variable that holds the file location of the purchase_data csv file)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [2]:
# View the dataframe purchase_data created by reading the csv file
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [3]:
# Calculate the total number of unique players
# create a new dataframe with columns "Gender", "SN", and "Age" using the .loc method
player_demographics = purchase_data.loc[:, ["Gender", "SN", "Age"]]
player_demographics

     Gender             SN  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
775  Female     Aethedru70   21
776    Male         Iral74   21
777    Male     Yathecal72   20
778    Male        Sisur91    7
779    Male      Ennrian78   24

[780 rows x 3 columns]

In [4]:
# Drop duplicates from player_demographics using method .drop_duplicates()
player_demographics = player_demographics.drop_duplicates() # note the change in player_demographics rows from 780 to 576
player_demographics

     Gender             SN  Age
0      Male        Lisim78   20
1      Male    Lisovynya38   40
2      Male     Ithergue48   24
3      Male  Chamassasya86   24
4      Male      Iskosia90   23
..      ...            ...  ...
773    Male         Hala31   21
774    Male     Jiskjask80   11
775  Female     Aethedru70   21
777    Male     Yathecal72   20
778    Male        Sisur91    7

[576 rows x 3 columns]

In [5]:
# Assign variable number_players use the .count() method to count all of fields in player_demographics
# using [0] indexing to assign just the first entry to number of players
number_players = player_demographics.count()[0]  # try this without the [0] and notice the difference
number_players

576

In [6]:
# We can use print and f-string fomating to add context to the output
print(f"The total number of unique players is: {number_players}")

The total number of unique players is: 576

In [7]:
# Create dataframe with one column called "Total Players" using the pandas method .DataFrame 
# try typing just pd. and then use the tab key to see all the methods available with pandas
total_players = pd.DataFrame({"Total Players": [number_players]})
total_players

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [8]:
# Calculate unique items
item_count = len(purchase_data["Item ID"].unique())
print(f" The number of unique items available to purchase are: {item_count}")

 The number of unique items available to purchase are: 179

In [9]:
# Calculate average purchase price 
avg_purchase_price = purchase_data["Price"].mean()
print(f" The average puchase price is: ${avg_purchase_price:,.2f}") # add $ in the f-string before the variable and two decimal formating to f-string by adding :,.2f to the variable itself

 The average puchase price is: $3.05

In [10]:
# Calculate total number of purchases using the Python len function
# Note assumes each "Purchase ID" is a unique purchase 
total_number_purchases = len(purchase_data["Purchase ID"])
print(f" The total number of purchases is: {total_number_purchases:,}") # added the :, "comma" formating in case the value was larger

 The total number of purchases is: 780

In [11]:
# Calculate the total revenue by using the Pandas .sum() method
total_revenue = purchase_data["Price"].sum()
print(f"The total revenue genderated from all sales is: ${total_revenue:,.2f}")

The total revenue genderated from all sales is: $2,379.77

In [12]:
# Create a dataframe to communicate the purchase analysis report using the Pandas DataFrame method
purchase_analysis = pd.DataFrame({
    "Number of Unique Items": [item_count],
    "Average Price": [avg_purchase_price],
    "Number of Purchases": [total_number_purchases],
    "Total Revenue": [total_revenue]
                                 })
purchase_analysis

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [13]:
purchase_analysis.dtypes

Number of Unique Items      int64
Average Price             float64
Number of Purchases         int64
Total Revenue             float64
dtype: object

In [14]:
# format the purchase analysis using the Pandas method .round(), .map to iterate overall values in a column 
# and .format to convert to string (object) and change formating adding , $ or 2 decimal places (if cases where round is not used)
purchase_analysis = purchase_analysis.round(2) # round to 2 places after the zero
purchase_analysis["Average Price"] = purchase_analysis["Average Price"].map("${:,.2f}".format) # adds $ and duplicate way to round to 2 figures past decimal
purchase_analysis["Total Revenue"] = purchase_analysis["Total Revenue"].map("${:,.2f}".format) # adds $ - currency formating
purchase_analysis # note: you will get an error when you run this cell twice. Solution is to run the DataFrame above and then run formatting.

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [15]:
# note the change in data types (using dtypes) between the unformatted DataFrame and the formatted DataFrame
purchase_analysis.dtypes # Columns that have been formatted are now "strings" also referred to as objects

Number of Unique Items     int64
Average Price             object
Number of Purchases        int64
Total Revenue             object
dtype: object

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [16]:
# calculate gender totals using Pandas DataFrame value_counts() method 
gender_demographics_totals = player_demographics["Gender"].value_counts()
gender_demographics_totals

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [17]:
# calculate gender percentages using earlier created series number_players (number of unique players)
gender_demographics_percentages = gender_demographics_totals / number_players
gender_demographics_percentages

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [18]:
# create a DataFrame for gender_demographics using Pandas DataFrame method
# 
gender_demographics = pd.DataFrame({
    "Total Count": gender_demographics_totals,
    "Percentage of Players": gender_demographics_percentages
})
gender_demographics

                       Total Count  Percentage of Players
Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097

In [19]:
# format the Percenage of Players column
gender_demographics["Percentage of Players"] = gender_demographics["Percentage of Players"].map("{:,.2%}".format)
gender_demographics

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [20]:
# view puchase_data DataFrame
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [21]:
# calculate purchase count by gender using groupby with aggregation of .sum() 
# select only the "Price" column and rename (using rename() the column "Total Puchase Value" and assign to the variable gender_purchase_total
gender_purchase_total = purchase_data.groupby(["Gender"]).sum()["Price"].rename("Average Purchase Price")
gender_purchase_total

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Average Purchase Price, dtype: float64

In [22]:
# calculate the average purchase price for each gender using groupby with aggregation of .mean()
# select only the "Price" column and rename using rename() method
gender_avg_purchase_price = purchase_data.groupby(["Gender"]).mean()["Price"].rename("Average Purchase Price")
gender_avg_purchase_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Average Purchase Price, dtype: float64

In [23]:
# calculate the count of purchase by gender using groupby with aggregation of count()
# select only the "Price" column and rename using rename() method
gender_purchase_counts = purchase_data.groupby(["Gender"]).count()["Price"].rename("Purchase Count")
gender_purchase_counts

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase Count, dtype: int64

In [24]:
# calculate the avg total purchase per person by gender using gender_demographics["Total Count"]
gender_avg_purchase_total = gender_purchase_total / gender_demographics["Total Count"]
gender_avg_purchase_total

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [25]:
# create a DataFrame for the Purchase Analysis by Gender using Pandas DataFrame
gender_purchase_analysis = pd.DataFrame({
    "Purchase Count": gender_purchase_counts,
    "Average Purchase Price": gender_avg_purchase_price,
    "Total Purchase Value": gender_purchase_total,
    "Avg Total Purchase per Person": gender_avg_purchase_total
})
gender_purchase_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [26]:
# format DataFrame for currency 
gender_purchase_analysis["Average Purchase Price"] = gender_purchase_analysis["Average Purchase Price"].map("${:,.2f}".format)
gender_purchase_analysis["Total Purchase Value"] = gender_purchase_analysis["Total Purchase Value"].map("${:,.2f}".format)
gender_purchase_analysis["Avg Total Purchase per Person"] = gender_purchase_analysis["Avg Total Purchase per Person"].map("${:,.2f}".format)
gender_purchase_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [27]:
# establish bins with "edges" for age broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)
# 99999 is being used as just a "large number"
# note the number of commas seperating the values in the bins must equal the number of group_names for the bins
age_bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 99999]
age_group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"] #note eight group names and eight commas in bins list

# seperate player_demographics into 'Age Ranges' using Pandas cut() method
# note added the .loc method to select all rows in the "Ages Ranges" column and "Age" columns based on warning message
player_demographics.loc[:, "Age Ranges"] = pd.cut(player_demographics.loc[:,("Age")], age_bins, labels=age_group_names)
player_demographics.loc[:, "Age Ranges"]

C:\Users\jamie\anaconda3\lib\site-packages\pandas\core\indexing.py:844: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = _infer_fill_value(value)
C:\Users\jamie\anaconda3\lib\site-packages\pandas\core\indexing.py:965: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
       ...
773    20-24
774    10-14
775    20-24
777    20-24
778      <10
Name: Age Ranges, Length: 576, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [28]:
# calculate the number of number of players for each age range using Pandas method value_counts()
age_demographics_totals = player_demographics["Age Ranges"].value_counts()
age_demographics_totals

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Ranges, dtype: int64

In [29]:
# calculate the percentage of players for each age range using age_demographics_totals and number_players created earlier
age_demographics_percentage = age_demographics_totals / number_players
age_demographics_percentage

20-24    0.447917
15-19    0.185764
25-29    0.133681
30-34    0.090278
35-39    0.053819
10-14    0.038194
<10      0.029514
40+      0.020833
Name: Age Ranges, dtype: float64

In [30]:
# create a DataFrame for the Age Demographics Analysis using Pandas DataFrame method
age_demographics = pd.DataFrame({
    "Total Count": age_demographics_totals,
    "Percentage of Players": age_demographics_percentage
})
age_demographics

       Total Count  Percentage of Players
20-24          258               0.447917
15-19          107               0.185764
25-29           77               0.133681
30-34           52               0.090278
35-39           31               0.053819
10-14           22               0.038194
<10             17               0.029514
40+             12               0.020833

In [31]:
# format DataFrame
age_demographics["Percentage of Players"] = age_demographics["Percentage of Players"].map("{:,.2%}".format)

# sort DataFrame using Pandas sort_index method
age_demographics.sort_index()

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [32]:
# bin the purchase_data DataFrame by age using Pandas cut method
# use existing bins and lables
purchase_data["Age Ranges"] = pd.cut(purchase_data["Age"], age_bins, labels=age_group_names)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [33]:
# calculate purchase count for age using groupby with aggregation of sum()
# keep on the "Price" column and rename using rename method to "Total Purchase Value"
age_purchase_total = purchase_data.groupby(["Age Ranges"]).sum()["Price"].rename("Total Purchase Value")
age_purchase_total

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Total Purchase Value, dtype: float64

In [34]:
# calculage avg purchase price for age using groupby with aggregation of mean()
# keep only the "Price" column and rename using the rename method as "Average Purchase Price"
age_avg_purchase_price = purchase_data.groupby(["Age Ranges"]).mean()["Price"].rename("Average Purchase Price")
age_avg_purchase_price

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Average Purchase Price, dtype: float64

In [35]:
# calcuate age purchase count using groupby with aggregation of count()
# keep only the "Price" column and rename using rename method as "Purchase Count"
age_purchase_counts = purchase_data.groupby(["Age Ranges"]).count()["Price"].rename("Purchase Count")
age_purchase_counts

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase Count, dtype: int64

In [36]:
# calculate the average total purchase using age_purchase_total and age_demographic["Total Count"]
age_avg_total_purchase_per_person = age_purchase_total / age_demographics["Total Count"]
age_avg_total_purchase_per_person

<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [37]:
# create a DataFrame to hold the Purchase Analyis by Age using Pandas DateFrame method
purchase_analysis_by_age = pd.DataFrame({
    "Purchase Count": age_purchase_counts,
    "Average Purchase Price": age_avg_purchase_price,
    "Total Purchase Value": age_purchase_total,
    "Avg Total Purchase per Person": age_avg_total_purchase_per_person
})
purchase_analysis_by_age

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [38]:
# format the DataFrame using .map to iterate over all values in a specific column and apply string formating
purchase_analysis_by_age["Average Purchase Price"] = purchase_analysis_by_age["Average Purchase Price"].map("${:,.2f}".format)
purchase_analysis_by_age["Total Purchase Value"] = purchase_analysis_by_age["Total Purchase Value"].map("${:,.2f}".format)
purchase_analysis_by_age["Avg Total Purchase per Person"] = purchase_analysis_by_age["Avg Total Purchase per Person"].map("${:,.2f}".format)

purchase_analysis_by_age.sort_index() # put the age ranges in order using sort_index (since the DataFrame is indexed by Age Range)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [39]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [40]:
# calculate total purchases by user (aka "SN" or screen)using groupby with aggregation of sum()
# keep only the "Price" column and rename using rename method as "Total Purchase Value"
sn_user_total_purchases = purchase_data.groupby(["SN"]).sum()["Price"].rename("Total Purchase Value")
sn_user_total_purchases

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Total Purchase Value, Length: 576, dtype: float64

In [41]:
# calculate average purchases by user (aka "SN") using groupby with aggregation of mean()
# keep only the "Price" colunn and rename using rename method as "Average Purchase Price"
sn_user_avg_purchase = purchase_data.groupby(["SN"]).mean()["Price"].rename("Average Purchase Price")
sn_user_avg_purchase

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Average Purchase Price, Length: 576, dtype: float64

In [42]:
# calculate count of purchases by user (aka "SN") using groupby with aggregation of count()
# keep only the "Price" column and rename using rename method as "Purchase Count"
sn_user_purchase_count = purchase_data.groupby(["SN"]).count()["Price"].rename("Purchase Count")
sn_user_purchase_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase Count, Length: 576, dtype: int64

In [43]:
# create DataFrame for by_screen_name_analysis using Pandas DataFrame method
by_screen_name_analysis = pd.DataFrame({
    "Purchase Count": sn_user_purchase_count,
    "Average Purchase Price": sn_user_avg_purchase,
    "Total Purchase Value": sn_user_total_purchases
})
by_screen_name_analysis

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [44]:
# examine the results for min, max etc. using DataFrame describe() method
by_screen_name_analysis.describe() # note the max Total Purchase Value is $18.96

       Purchase Count  Average Purchase Price  Total Purchase Value
count      576.000000              576.000000            576.000000
mean         1.354167                3.046047              4.131545
std          0.626585                1.069521              2.404705
min          1.000000                1.000000              1.000000
25%          1.000000                2.152500              2.450000
50%          1.000000                3.090000              3.720000
75%          2.000000                3.864375              4.902500
max          5.000000                4.990000             18.960000

In [45]:
# Note you should rename the DataFrame to indicate it has been sorted and to apply formating to the sorted DataFrame
# sort the by_screen_name_analysis by "Total Purchase Value" in descending order using ascending=False augument
sorted_by_screen_name_analysis = by_screen_name_analysis.sort_values(by=["Total Purchase Value"], ascending=False)

# format the DataFrame
sorted_by_screen_name_analysis["Average Purchase Price"] = sorted_by_screen_name_analysis["Average Purchase Price"].map("${:,.2f}".format)
sorted_by_screen_name_analysis["Total Purchase Value"] = sorted_by_screen_name_analysis["Total Purchase Value"].map("${:,.2f}".format)

sorted_by_screen_name_analysis

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10
...                     ...                    ...                  ...
Ililsasya43               1                  $1.02                $1.02
Irilis75                  1                  $1.02                $1.02
Aidai61                   1                  $1.01                $1.01
Chanirra79                1                  $1.01                $1.01
Alo38                     1                  $1.00                $1.00

[576 rows x 3 columns]

In [46]:
# determine top spenders using DataFrame head() method, note: head() will defalt top five but you can enter any number like top 10 
sorted_by_screen_name_analysis.head(10)

              Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                  5                  $3.79               $18.96
Idastidru52                4                  $3.86               $15.45
Chamjask73                 3                  $4.61               $13.83
Iral74                     4                  $3.40               $13.62
Iskadarya95                3                  $4.37               $13.10
Ilarin91                   3                  $4.23               $12.70
Ialallo29                  3                  $3.95               $11.84
Tyidaim51                  3                  $3.94               $11.83
Lassilsala30               3                  $3.84               $11.51
Chadolyla44                3                  $3.82               $11.46

## Most Popular Items by Purchase Count

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [47]:
# view purchase_data
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [48]:
# retrieve Item ID, Item Name, and Item Price using .loc method 
# note for a list of columns use double brackets [[ ]] with :, inside to indicate you want all rows (you can specify row on left of : and column on right)
# see documentation
item_data = purchase_data.loc[:,["Item ID", "Item Name", "Price"]]
item_data

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [49]:
# use the item_data DataFrame created above to groupby Item ID and Item Name using sum() for aggregation
# keep only the "Price" column and rename as "Total Purchase Value"
sum_totals_for_items_purchased =  item_data.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value")
sum_totals_for_items_purchased

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Total Purchase Value, Length: 179, dtype: float64

In [50]:
# calculate average price for items purchased using groupby Item ID and Item Name and aggregation .mean()
# keep only the "Price" column
avg_for_items_purchased = item_data.groupby(["Item ID", "Item Name"]).mean()["Price"]
avg_for_items_purchased

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Price, Length: 179, dtype: float64

In [51]:
# calculate (for each item) the count of purchases using groupby Item ID and Item Name and aggregation .count()
# keep only the "Price" column
count_of_items_purchased = item_data.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
count_of_items_purchased

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Purchase Count, Length: 179, dtype: int64

In [52]:
# create a DataFrame to hold the Most Popular Items Analysis
items_analysis = pd.DataFrame({
    "Purchase Count": count_of_items_purchased,
    "Item Price": avg_for_items_purchased,
    "Total Purchase Value": sum_totals_for_items_purchased
})
items_analysis.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4      1.2800                  5.12
1       Crucifer                         4      2.9425                 11.77
2       Verdict                          6      2.4800                 14.88
3       Phantomlight                     6      2.4900                 14.94
4       Bloodlord's Fetish               5      1.7000                  8.50

In [53]:
# sort items_analysis and assign to new variable sorted_items_analysis
sorted_items_analysis = items_analysis.sort_values("Purchase Count", ascending=False)

# format DataFrame
sorted_items_analysis["Item Price"] = sorted_items_analysis["Item Price"].map("${:,.2f}".format)
sorted_items_analysis["Total Purchase Value"] = sorted_items_analysis["Total Purchase Value"].map("${:,.2f}".format)
sorted_items_analysis.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

In [54]:
# Perform calculations to obtain purchase count, item price, and total purchase value

## Items Generating the Most Revenue

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [55]:
# sort items_analysis by "Total Purchase Value" in descending order (ascending=False) assign to new variable
items_by_total_purchase = items_analysis.sort_values("Total Purchase Value", ascending=False)
items_by_total_purchase.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

In [56]:
# format the DataFrame
items_by_total_purchase["Item Price"] = items_by_total_purchase["Item Price"].map("${:,.2f}".format)
items_by_total_purchase["Total Purchase Value"] = items_by_total_purchase["Total Purchase Value"].map("${:,.2f}".format)
items_by_total_purchase.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80